<?php

class Constants {

	static public $arabicMonths = array("يناير", "فبراير", "مارس", "إبريل", "مايو", "يونيو", "يوليو", "أغسطس", "سبتمبر", "أكتوبر", "نوفمبر", "ديسمبر");
    static public $countries = array(
        'SA' => 'السعودية',
        
        'EG' => 'مصر',
        
        'JO' => 'الاردن',
        
        'IQ' => 'العراق',
        
        'LB' => 'لبنان',
        
        'OM' => 'عمان',
        
        'PS' => 'فلسطين',
        
        'DZ' => 'الجزائر',
        
        'LY' => 'ليبيا',
        
        'KW' => 'الكويت',
        
        'AE' => 'الامارات',
        
        'SY' => 'سوريا',
        
        'MA' => 'المغرب',
        
        'SO' => 'الصومال',
        
        'YE' => 'اليمن',
        
        'MR' => 'موريتانيا',
        
        'BH' => 'البحرين',
        
        'TN' => 'تونس',
        
        'QA' => 'قطر',
        
        'SD' => 'السودان',
        
        'IR' => 'ايران',
        
        'ET' => 'اثيوبيا',
        
        'ES' => 'اسبانيا',
        
        'AU' => 'استراليا',
        
        'EE' => 'استونيا',
        
        'AZ' => 'أذربيجان',
        
        'AM' => 'ارمينيا',
        
        'AW' => 'اروبا',
        
        'ER' => 'اريتيريا',
        
        'AF' => 'أفغانستان',
        
        'GL' => 'الارض الخضراء',
        
        'AR' => 'الارجنتين',
        
        'TF' => 'الاقاليم الجنوبية الفرنسية',
        
        'AL' => 'البانيا',
        
        'BA' => 'البوسنة و الهرسك',
        
        'VI' => 'الجزر العذراء',
        
        'DO' => 'الجمهورية الدومنيكية',
        
        'KR' => 'الحمهورية الكورية',
        
        'DK' => 'الدنمارك',
        
        'CV' => 'الراس الاخضر',
        
        'SE' => 'السويد',
        
        'EH' => 'الصحارى الغربية',
        
        'CN' => 'الصين',
        
        'DE' => 'المانيا',
        
        'AT' => 'النمسا',
        
        'IN' => 'الهند',
        
        'JP' => 'اليابان',
        
        'GR' => 'اليونان',
        
        'IO' => 'اقليم المحيط الهندي البريطاني',
        
        'US' => 'أمريكا',
        
        'AG' => 'انتيغوا وبربودا',
        
        'AD' => 'اندورا',
        
        'ID' => 'اندونيسيا',
        
        'AO' => 'انغولا',
        
        'UZ' => 'اوزباكستان',
        
        'EC' => 'اوكادور',
        
        'UA' => 'اوكرانيا',
        
        'UY' => 'اورغويه',
        
        'UG' => 'اوغاندا',
        
        'IS' => 'ايسلندا',
        
        'IE' => 'ايرلندا',
        
        'IT' => 'ايطاليا',
        
        'PG' => 'بابوا غينيا الجديده',
        
        'PW' => 'بالو',
        
        'BB' => 'باربادوس',
        
        'PK' => 'باكستان',
        
        'PA' => 'باناما',
        
        'BD' => 'بانقلادش',
        
        'BS' => 'باهاماز',
        
        'BR' => 'برازيل',
        
        'PT' => 'برتغال',
        
        'BM' => 'برمودا',
        
        'BF' => 'بركينا فاسو',
        
        'BN' => 'بروناي',
        
        'PY' => 'برغويه',
        
        'BE' => 'بلجيكيا',
        
        'BG' => 'بلغاريا',
        
        'GB' => 'بريطانيا',
        
        'BT' => 'بوتان',
        
        'BW' => 'بوتسوانا',
        
        'MM' => 'بورما',
        
        'BI' => 'بوروندي',
        
        'PL' => 'بولندا',
        
        'PF' => 'بولينيزيا الفرنسيه',
        
        'BO' => 'بوليفيا',
        
        'PR' => 'بويرتو ريكو',
        
        'PE' => 'بيروا',
        
        'BY' => 'بيلاروسيا',
        
        'BZ' => 'بيلز',
        
        'BJ' => 'بينين',
        
        'TJ' => 'تاجخستان',
        
        'TZ' => 'تانزانيا',
        
        'TH' => 'تايلاند',
        
        'TW' => 'تايوان',
        
        'TD' => 'تشاد',
        
        'CL' => 'تشيلي',
        
        'TR' => 'تركيا',
        
        'TM' => 'تركمستان',
        
        'TT' => 'ترينيداد و تاباغو',
        
        'TG' => 'توغو',
        
        'TK' => 'توكيلاو',
        
        'TV' => 'توفالو',
        
        'TO' => 'تونغو',
        
        'TL' => 'تيمور الشرقيه',
        
        'GI' => 'جبل طارق',
        
        'AN' => 'جزر الانتيل الهولندية',
        
        'VG' => 'جزر العذراء',
        
        'MH' => 'جزر المارشال',
        
        'MP' => 'جزر الماريانا الشمالية',
        
        'TC' => 'جزر تركس وكايكوس',
        
        'SB' => 'جزر سليمان',
        
        'FO' => 'جزر فارو',
        
        'FK' => 'جزر فوكلاند (مالفيناس)',
        
        'KY' => 'جزر كايمان',
        
        'CK' => 'جزر كوك',
        
        'JM' => 'جمايكا',
        
        'CD' => 'جمهورية الكونغو الديقراطية',
        
        'CF' => 'جمهوريه افريقيا الوسطي',
        
        'ZA' => 'جنوب افريقيا',
        
        'GE' => 'جورجيا',
        
        'DJ' => 'جيبوتي',
        
        'DM' => 'دومونيكيا',
        
        'RW' => 'راواندا',
        
        'RU' => 'روسيا',
        
        'RO' => 'رومانيا',
        
        'RE' => 'ريونيون',
        
        'ZM' => 'زامبيا',
        
        'ZW' => 'زمبابوي',
        
        'CI' => 'ساحل العاج',
        
        'WS' => 'سامو',
        
        'AS' => 'ساموا الامريكية',
        
        'VC' => 'سانت فنسنت وغرينادين',
        
        'LC' => 'سانت لوسيا',
        
        'SM' => 'سان مارينو',
        
        'ST' => 'ساو تومي وبرينسيبي',
        
        'SC' => 'سايتشيلي',
        
        'SV' => 'سلفادور',
        
        'SK' => 'سلوفاكيا',
        
        'SI' => 'سلوفينيا',
        
        'SN' => 'سنغال',
        
        'SG' => 'سنغافورة',
        
        'SZ' => 'سوازيلند',
        
        'SR' => 'سورينام',
        
        'CH' => 'سويسرا',
        
        'SL' => 'سيراليون',
        
        'LK' => 'سيريلانكا',
        
        'CS' => 'صربيا و الجبل الاسود',
        
        'GA' => 'غابون',
        
        'GM' => 'غامبيا',
        
        'GH' => 'غانا',
        
        'GD' => 'غرينادا',
        
        'GT' => 'غواتيمالا',
        
        'GP' => 'غواديلوب',
        
        'GU' => 'غوام',
        
        'GY' => 'غينيا',
        
        'GQ' => 'غينيا الاستواءيه',
        
        'GW' => 'غينيا - بيساو',
        
        'GF' => 'غيانا الفرنسيه',
        
        'VA' => 'فاتيكان',
        
        'VU' => 'فانواتو',
        
        'FR' => 'فرنسا',
        
        'FI' => 'فنلندا',
        
        'VN' => 'فيتنام',
        
        'FJ' => 'فيجي',
        
        'PH' => 'فيلبين',
        
        'VE' => 'فينزويلا',
        
        'CY' => 'قبرص',
        
        'KG' => 'قرغيزستان',
        
        'KZ' => 'كازاخستان',
        
        'NC' => 'كاليدونيا الجديده',
        
        'KH' => 'كامبوديا',
        
        'CM' => 'كامرون',
        
        'KI' => 'كرباتيا',
        
        'HR' => 'كرواتيا',
        
        'CA' => 'كندا',
        
        'CU' => 'كوبا',
        
        'CO' => 'كولومبيا',
        
        'CG' => 'كونغو',
        
        'CR' => 'كوستاريكا',
        
        'KE' => 'كينيا',
        
        'LV' => 'لاتافيا',
        
        'LA' => 'لاووس',
        
        'LR' => 'ليبيريا',
        
        'LT' => 'ليتوانيل',
        
        'LI' => 'ليختننشتاين',
        
        'LS' => 'ليسوتو',
        
        'LU' => 'لوكسمبورغ',
        
        'MQ' => 'مارتينيكوي',
        
        'MV' => 'مالديف',
        
        'MT' => 'مالطا',
        
        'ML' => 'مالي',
        
        'MY' => 'ماليزيا',
        
        'MO' => 'ماكو',
        
        'MG' => 'مدغشقر',
        
        'MX' => 'مكسيك',
        
        'MW' => 'ملاوي',
        
        'MN' => 'منقوليا',
        
        'MZ' => 'موزامبيق',
        
        'MU' => 'موريشيوس',
        
        'MD' => 'موليدافيا',
        
        'MC' => 'موناكو',
        
        'FM' => 'ميكرونيزيا',
        
        'NO' => 'نرويج',
        
        'NG' => 'نيجيريا',
        
        'NE' => 'نيجر',
        
        'NI' => 'نيكارغوا',
        
        'NA' => 'ناميبيا',
        
        'NP' => 'نيبال',
        
        'NR' => 'نورو',
        
        'HT' => 'هايِتي',
        
        'HN' => 'هندوراس',
        
        'HU' => 'هنغاريا',
        
        'NL' => 'هولندا',
        
        'HK' => 'هونغ كونغ',
        
        'MK' => 'يوغسلافيا',
        
        'AY' => 'دولة اخرى'
    );
}
?>